In [1]:
import pandas as pd
import numpy as np

In [2]:
# get the powers of an array values element-wise
#First array elements raised to powers from second array

In [3]:
df = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]})
df

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [4]:
# create and display a DataFrame from a specified dictionary data which has the index labels

In [5]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [6]:
df = pd.DataFrame(exam_data,index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [7]:
#  display a summary of the basic information about a specified DataFrame and its data

In [23]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [29]:
df = pd.DataFrame(exam_data,index=labels)
df.head()
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
name        10 non-null object
score       8 non-null float64
attempts    10 non-null int64
qualify     10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [31]:
# get the first 3 rows of a given DataFrame

In [32]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [36]:
df=pd.DataFrame(exam_data,index=labels)
df.iloc[:3]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [37]:
#  select the 'name' and 'score' columns from the following DataFrame

In [43]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data,index=labels)
df.head()

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no

In [48]:
print("Name and scores:")
print(df[['name','score']])

Name and scores:
        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [50]:
# select the rows where the number of attempts in the examination is greater than 2

In [51]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data,index=labels)
df.head()

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no

In [58]:
df = pd.DataFrame(exam_data,index=labels)
result = df[df['attempts']>2]
result

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

In [64]:
df.shape[1]

4

In [65]:
# shape is use in pandas to give number of row/column:

# Number of rows is given by:

#df.shape[0]

#Number of columns is given by

#df.shape[1]

In [66]:
df.shape[0]

10

In [67]:
# select the rows where the score is missing, i.e. is NaN

In [69]:
result = df[df['score'].isnull()]
result

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [70]:
# select the rows the score is between 15 and 20

In [72]:
result = df[df['score'].between(15,20)]
result

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [73]:
# select the rows where number of attempts in the examination is less than 2 and score greater than 15

In [85]:
result = df[(df['attempts']<3) & (df['score']>15)]
result

        name  score  attempts qualify
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes

In [86]:
# change the score in row 'd' to 11.5

In [87]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data,index=labels)
df.head()

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no

In [90]:
df.loc['d','score'] =11.5
df.head()

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no

In [91]:
# calculate the sum of the examination attempts by the students

In [93]:
df.sum(axis=0)

name        AnastasiaDimaKatherineJamesEmilyMichaelMatthew...
score                                                     120
attempts                                                   19
qualify                             yesnoyesnonoyesyesnonoyes
dtype: object

In [96]:
df['attempts'].sum()

19

In [94]:
df.sum(axis=1)

a    13.5
b    12.0
c    18.5
d    14.5
e    11.0
f    23.0
g    15.5
h     1.0
i    10.0
j    20.0
dtype: float64

In [97]:
# calculate the mean score for each different student in DataFrame

In [98]:
df.head()

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no

In [99]:
df['score'].mean()

13.333333333333334

In [100]:
# append a new row 'k' to data frame with given values for each column. 
# Now delete the new row and return the original DataFrame

In [101]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data,index=labels)
df.head()

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no

In [106]:
df.loc['k']=["Suresh", 15.5,  1, "yes"]
df.tail()

      name  score  attempts qualify
g  Matthew   14.5         1     yes
h    Laura    NaN         1      no
i    Kevin    8.0         2      no
j    Jonas   19.0         1     yes
k   Suresh   15.5         1     yes

In [107]:
# delete the new record and display original

In [112]:
df.drop('k',inplace = True)

In [113]:
df.tail()

      name  score  attempts qualify
f  Michael   20.0         3     yes
g  Matthew   14.5         1     yes
h    Laura    NaN         1      no
i    Kevin    8.0         2      no
j    Jonas   19.0         1     yes

In [114]:
# sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order

In [125]:
df.sort_values(by=['name','score'],ascending=[False,True])

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [126]:
# replace the 'qualify' column contains the values 'yes' and 'no' with True and False

# MAP FUNCTON TO REPLACE VALUES IN DATA FRAME

In [138]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data , index=labels)

In [139]:
print("Orginal rows:")
print(df)
print("\nReplace the ‘qualify' column contains the values 'yes' and 'no'  with True and  False:")
df['qualify'] = df['qualify'].map({'yes': True, 'no': False})
print(df)

Orginal rows:
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Replace the ‘qualify' column contains the values 'yes' and 'no'  with True and  False:
        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

In [140]:
# change the name 'James' to 'Suresh' in name column of the DataFrame.

In [156]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data , index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [155]:
df['name']=df['name'].replace('James','Suresh')
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d     Suresh    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [157]:
# delete the 'attempts' column from the DataFrame

In [160]:
df.pop('attempts')

a    1
b    3
c    2
d    3
e    2
f    3
g    1
h    1
i    2
j    1
Name: attempts, dtype: int64

In [161]:
df

        name  score qualify
a  Anastasia   12.5     yes
b       Dima    9.0      no
c  Katherine   16.5     yes
d      James    NaN      no
e      Emily    9.0      no
f    Michael   20.0     yes
g    Matthew   14.5     yes
h      Laura    NaN      no
i      Kevin    8.0      no
j      Jonas   19.0     yes

In [162]:
# insert a new column in existing DataFrame

In [163]:
color = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']
df['color'] = color

In [164]:
df

        name  score qualify   color
a  Anastasia   12.5     yes     Red
b       Dima    9.0      no    Blue
c  Katherine   16.5     yes  Orange
d      James    NaN      no     Red
e      Emily    9.0      no   White
f    Michael   20.0     yes   White
g    Matthew   14.5     yes    Blue
h      Laura    NaN      no   Green
i      Kevin    8.0      no   Green
j      Jonas   19.0     yes     Red

In [165]:
# iterate over rows in a DataFrame

In [10]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data , index=labels)

In [9]:
for index, row in df.iterrows():
    print(row['name'],row['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5
James nan
Emily 9.0
Michael 20.0
Matthew 14.5
Laura nan
Kevin 8.0
Jonas 19.0

In [11]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data , index=labels)

In [13]:
# list(my_dataframe.columns.values)

# list(my_dataframe)

# to get list from DataFrame column headers

In [16]:
list(df)

['name', 'score', 'attempts', 'qualify']

In [17]:
list(df.columns.values)

['name', 'score', 'attempts', 'qualify']

# rename columns of a given DataFrame.

In [19]:
import pandas as pd

d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)

df.columns = ['Column1', 'Column2', 'Column3']
df = df.rename(columns={'col1': 'Column1', 'col2': 'Column2', 'col3': 'Column3'})
print("New DataFrame after renaming columns:")
print(df)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9
New DataFrame after renaming columns:
   Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

In [24]:
original_df = {'col1': [1,2,3], 'col2': [4,5,6], 'col3':[7,8,9]}

df = pd.DataFrame(data= original_df)
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [26]:
df.columns = ['Column1','Column2','Column3']

df.rename(columns={'col1':'Column1','col2':'Column2','col3':'Column3'})
print("New Dataframe:")
df.head()

New Dataframe:

   Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

In [27]:
# change the order of a DataFrame columns

In [28]:
import pandas as pd

In [31]:
d = {'col1':[1,4,3,4,5],'col2':[4,5,6,7,8],'col3':[7,8,9,0,1]}
df = pd.DataFrame(data=d)

df

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [32]:
df[['col3','col2','col1']]

   col3  col2  col1
0     7     4     1
1     8     5     4
2     9     6     3
3     0     7     4
4     1     8     5

In [33]:
# add one row in an existing DataFrame

# APPEND METHOD

In [34]:
d = {'col1':[1,4,3,4,5],'col2':[4,5,6,7,8],'col3':[7,8,9,0,1]}

df = pd.DataFrame(data=d)
df

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [35]:
df2 = {'col1':10,'col2':11,'col3':12}

df = df.append(df2,ignore_index=True)
df

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
5    10    11    12

In [39]:
# write a DataFrame to CSV file using tab separator

In [41]:
print('Data from new_file.csv file:')
df.to_csv('new_file.csv', sep='\t', index=False)
new_df = pd.read_csv('new_file.csv')

Data from new_file.csv file:

In [53]:
df = {'col1':[1,4,3,4,5],'col2':[4,5,6,7,8],'col3':[7,8,9,0,1]}
df = pd.DataFrame(df)
df.head()

print("Data from new_file.csv file:")
df1.to_csv('new_file.csv',sep='\t',index=False)
new_df = pd.read_csv('new_file.csv')
new_df

Data from new_file.csv file:

  col1\tcol2\tcol3
0          1\t4\t7
1          4\t5\t8
2          3\t6\t9
3          4\t7\t0
4          5\t8\t1

# SIZE() FUNCTION

# count city wise number of people from a given of data set (city, name of the person)

In [55]:
import pandas as pd
df1 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
                    'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']})

In [58]:
count_of_people = df1.groupby(['city']).size().reset_index(name='Number of People')
count_of_people

          city  Number of People
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

In [59]:
# delete DataFrame row(s) based on given column value

In [87]:
df = {'col1':[1,4,3,4,5],'col2':[4,5,6,7,8],'col3':[7,8,9,0,1]}
df = pd.DataFrame(df)

df[df.col2 != 5]

   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1

# DROPPING ROWS AND COLUMNS IN PANDAS DATAFRAME

In [60]:
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3]}

df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

             name  year  reports
Cochice     Jason  2012        4
Pima        Molly  2012       24
Santa Cruz   Tina  2013       31
Maricopa     Jake  2014        2
Yuma          Amy  2014        3

# drop a row

In [62]:
df.drop(['Cochice', 'Pima'])

            name  year  reports
Santa Cruz  Tina  2013       31
Maricopa    Jake  2014        2
Yuma         Amy  2014        3

# drop column

In [64]:
df.drop('reports',axis=1)

             name  year
Cochice     Jason  2012
Pima        Molly  2012
Santa Cruz   Tina  2013
Maricopa     Jake  2014
Yuma          Amy  2014

# drop row with certain value - Tina

In [68]:
df[df.name != 'Tina']

           name  year  reports
Cochice   Jason  2012        4
Pima      Molly  2012       24
Maricopa   Jake  2014        2
Yuma        Amy  2014        3

# drop row by row number

In [69]:
df.drop(df.index[2])

           name  year  reports
Cochice   Jason  2012        4
Pima      Molly  2012       24
Maricopa   Jake  2014        2
Yuma        Amy  2014        3

In [70]:
df.drop(df.index[0])

             name  year  reports
Pima        Molly  2012       24
Santa Cruz   Tina  2013       31
Maricopa     Jake  2014        2
Yuma          Amy  2014        3

# can be extended to dropping a range

In [77]:
df.drop(df.index[[2,3]])

          name  year  reports
Cochice  Jason  2012        4
Pima     Molly  2012       24
Yuma       Amy  2014        3

In [76]:
df

             name  year  reports
Cochice     Jason  2012        4
Pima        Molly  2012       24
Santa Cruz   Tina  2013       31
Maricopa     Jake  2014        2
Yuma          Amy  2014        3

In [78]:
df.drop(df.index[-2])

             name  year  reports
Cochice     Jason  2012        4
Pima        Molly  2012       24
Santa Cruz   Tina  2013       31
Yuma          Amy  2014        3

# keep top 3

In [79]:
df[:3]

             name  year  reports
Cochice     Jason  2012        4
Pima        Molly  2012       24
Santa Cruz   Tina  2013       31

# drop bottom 3

In [80]:
df[:-3]

          name  year  reports
Cochice  Jason  2012        4
Pima     Molly  2012       24

# widen output display to see more columns

In [88]:
import pandas as pd

In [90]:
data1 = {'col1':[1,4,3,4,5],
       'col2':[4,5,6,7,8],
       'col3':[7,8,9,0,1]}
data1 = pd.DataFrame(data=data1)
data1

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [92]:
pd.set_option('display.max_rows',500)
pd.set_option('display.width',1000)
pd.set_option('display.max_columns',500)
data1

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

# select a row of series/dataframe by given integer index

In [97]:
data1 = {'col1':[1,4,3,4,5],
       'col2':[4,5,6,7,8],
       'col3':[7,8,9,0,1]}
data1 = pd.DataFrame(data=data1)

In [98]:
data1.iloc[[2]]

   col1  col2  col3
2     3     6     9

In [99]:
data1.iloc[[2,3]]

   col1  col2  col3
2     3     6     9
3     4     7     0

# replace all the NaN values with Zero's in a column of a dataframe.

In [105]:
exam_data = {'name':['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 
       'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
       'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
       'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(data=exam_data)

df.head()

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no

In [107]:
print("New dataframe replacing all N.A with zeroes:")
df.fillna(0)
df

New dataframe replacing all N.A with zeroes:

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

# convert index in a column of the given dataframe

In [117]:
exam_data = {'name':['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 
       'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
       'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
       'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(data=exam_data)

In [118]:
df.reset_index(level=0,inplace=True)

In [110]:
df

   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      1       Dima    9.0         3      no
2      2  Katherine   16.5         2     yes
3      3      James    NaN         3      no
4      4      Emily    9.0         2      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    NaN         1      no
8      8      Kevin    8.0         2      no
9      9      Jonas   19.0         1     yes

# set/replace/change a given value for particular cell in  DataFrame using index value

In [122]:
df.set_value(index=8,col='qualify',value='yes')
df

C:\Users\juhi.dhingra\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead
  """Entry point for launching an IPython kernel.

   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      1       Dima    9.0         3      no
2      2  Katherine   16.5         2     yes
3      3      James    NaN         3      no
4      4      Emily    9.0         2      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    NaN         1      no
8      8      Kevin    8.0         2     yes
9      9      Jonas   19.0         1     yes

# count the NaN values in one or more columns in DataFrame.

In [125]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
            'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
            'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
            'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [124]:
df.isnull().values.sum()

2

In [126]:
df.fillna(0)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    0.0         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    0.0         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

# drop a list of rows from a specified DataFrame

In [133]:
frame = {'col1':[1,4,3,4,5],
         'col2':[4,5,6,7,8], 
         'col3':[7,8,9,0,1]}
d1= pd.DataFrame(data=frame)
d1

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [137]:
d1.drop(d1.index[[2,3]])

   col1  col2  col3
0     1     4     7
1     4     5     8
4     5     8     1

# reset index in a given DataFrame

In [11]:
import pandas as pd
import numpy as np

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
            'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
            'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
            'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [15]:
# drop 1st and 2nd row

In [16]:
df = df.drop([0,1])

In [17]:
df

   index     name  score  attempts qualify
2      4    Emily    9.0         2      no
3      5  Michael   20.0         3     yes
4      6  Matthew   14.5         1     yes
5      7    Laura    NaN         1      no
6      8    Kevin    8.0         2      no
7      9    Jonas   19.0         1     yes

In [18]:
print("reset index:")
df = df.reset_index()
df

reset index:

   level_0  index     name  score  attempts qualify
0        2      4    Emily    9.0         2      no
1        3      5  Michael   20.0         3     yes
2        4      6  Matthew   14.5         1     yes
3        5      7    Laura    NaN         1      no
4        6      8    Kevin    8.0         2      no
5        7      9    Jonas   19.0         1     yes

# divide a DataFrame in a given ratio

# 70% and 30% of the dataframe

# numpy

# combining two series into a DataFrame

In [23]:
import pandas as pd
import numpy as np
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])
s2 = pd.Series(['10', '20', 'php', '30.12', '40'])
s1
s2

0       10
1       20
2      php
3    30.12
4       40
dtype: object

# Join concat two series into dataframe

In [30]:
df = pd.concat([s1,s2],axis = 1)

In [31]:
df

        0      1
0     100     10
1     200     20
2  python    php
3  300.12  30.12
4     400     40

# convert DataFrame column type from string to datetime

In [44]:
import pandas as pd
import numpy as np

dates = pd.Series(['3/11/2000', '3/12/2000', '3/13/2000'])
dates

0    3/11/2000
1    3/12/2000
2    3/13/2000
dtype: object

In [45]:
dates_new = pd.to_datetime(dates)
dates_new

0   2000-03-11
1   2000-03-12
2   2000-03-13
dtype: datetime64[ns]

In [48]:
dates_new = pd.DataFrame(dates_new)
dates_new

           0
0 2000-03-11
1 2000-03-12
2 2000-03-13

# rename a specific column name in a given DataFrame

In [56]:
import pandas as pd
import numpy as np

d = {'col1':[1,2,3],
      'col2':[4,5,6],
      'col3':[7,8,9]}
df=pd.DataFrame(data=d)
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [57]:
df = df.rename(columns={'col2':'Column2'})
df

   col1  Column2  col3
0     1        4     7
1     2        5     8
2     3        6     9

# get a list of a specified column of a DataFrame

In [59]:
import pandas as pd
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
df

Original DataFrame

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [63]:
column_two_list = df["col2"].tolist()
column_two_list

[4, 5, 6]

In [65]:
column_three_list = df['col3'].tolist()
column_three_list

[7, 8, 9]

# check whether a given column is present in a DataFrame or not

In [68]:
import pandas as pd
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

In [71]:
if 'col1' in df.columns:
    print("Column1 is present")
else:
    print("Column1 is not present")

Column1 is present

In [72]:
if 'col4' in df.columns:
    print("Column 4 is present")
else:
    print("Column 4 is not present")

Column 4 is not present

# get the specified row value of a given DataFrame

In [74]:
import pandas as pd
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

In [78]:
# value of row 1

In [79]:
df.iloc[0]

col1    1
col2    4
col3    7
Name: 0, dtype: int64

In [80]:
# value of row 4

In [81]:
df.iloc[3]

col1    4
col2    9
col3    1
Name: 3, dtype: int64

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
col1    5 non-null int64
col2    5 non-null int64
col3    5 non-null int64
dtypes: int64(3)
memory usage: 200.0 bytes

# append data to an empty DataFrame

In [94]:
import pandas as pd
import numpy as np
df = pd.DataFrame()

data = pd.DataFrame({"col1": range(3),"col2": range(3)})

In [95]:
df = df.append(data)
df

   col1  col2
0     0     0
1     1     1
2     2     2

# sort a given DataFrame by two or more columns

In [97]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [102]:
df = df.sort_values(['attempts','qualify'],ascending=[True,True])
df

        name  score  attempts qualify
7      Laura    NaN         1      no
0  Anastasia   12.5         1     yes
9      Jonas   19.0         1     yes
6    Matthew   14.5         1     yes
4      Emily    9.0         2      no
8      Kevin    8.0         2      no
2  Katherine   16.5         2     yes
1       Dima    9.0         3      no
3      James    NaN         3      no
5    Michael   20.0         3     yes

# convert the datatype of a given column (floats to ints)

In [103]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9.1, 16.5, 12.77, 9.21, 20.22, 14.5, 11.34, 8.8, 19.13],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia  12.50         1     yes
1       Dima   9.10         3      no
2  Katherine  16.50         2     yes
3      James  12.77         3      no
4      Emily   9.21         2      no
5    Michael  20.22         3     yes
6    Matthew  14.50         1     yes
7      Laura  11.34         1      no
8      Kevin   8.80         2      no
9      Jonas  19.13         1     yes

In [106]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
name        10 non-null object
score       10 non-null float64
attempts    10 non-null int64
qualify     10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [107]:
df.score = df.score.astype(int)
df

        name  score  attempts qualify
0  Anastasia     12         1     yes
1       Dima      9         3      no
2  Katherine     16         2     yes
3      James     12         3      no
4      Emily      9         2      no
5    Michael     20         3     yes
6    Matthew     14         1     yes
7      Laura     11         1      no
8      Kevin      8         2      no
9      Jonas     19         1     yes

In [108]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
name        10 non-null object
score       10 non-null int32
attempts    10 non-null int64
qualify     10 non-null object
dtypes: int32(1), int64(1), object(2)
memory usage: 360.0+ bytes

# insert/add a new column at a specific column index in a DataFrame

In [118]:
import pandas as pd
d = {'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
df

   col2  col3
0     4     7
1     5     8
2     6    12
3     9     1
4     5    11

In [119]:
new_col = [1,2,3,4,5]
idx=0
df.insert(loc=idx,column='col1',value=new_col)
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     5     5    11

# convert a given list of lists into a Dataframe

In [129]:
import pandas as pd
my_lists = [['col1', 'col2'], [2, 4], [1, 3]]

In [130]:
# # sets the headers as list

In [131]:
headers = my_lists.pop(0)
my_lists

[[2, 4], [1, 3]]

In [132]:
df = pd.DataFrame(my_lists,columns=headers)
df

   col1  col2
0     2     4
1     1     3

# GROUPBY METHOD

# group by the first column and get second column as lists in rows

In [140]:
import pandas as pd
df = pd.DataFrame( {'col1':['C1','C1','C2','C2','C2','C3','C2'], 
                    'col2':[1,2,3,3,4,6,5]})
print("Original DataFrame")
df

Original DataFrame

  col1  col2
0   C1     1
1   C1     2
2   C2     3
3   C2     3
4   C2     4
5   C3     6
6   C2     5

In [141]:
df = df.groupby('col1')['col2'].apply(list)
df

col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

# get column index  of a given DataFrame

In [154]:
import pandas as pd

d = {'col1': [1, 2, 3, 4, 7], 
     'col2': [4, 5, 6, 9, 5], 
     'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
df

print("Index of col3:")
col_index = df.columns.get_loc("col3")
col_index

Index of col3:

2

In [155]:
print("Index of col1:")
col_index_1 = df.columns.get_loc("col1")
col_index_1

Index of col1:

0

# count number of columns of a DataFrame

In [158]:
import pandas as pd
d = {'col1': [1, 2, 3, 4, 7], 
     'col2': [4, 5, 6, 9, 5], 
     'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)

In [160]:
len(df.columns)

3

In [161]:
len(df)

5

# select all columns, except one

In [167]:
import pandas as pd
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

In [168]:
print("All columns except column3:")

df = df.loc[:,df.columns != 'col3']
df

All columns except column3:

   col1  col2
0     1     4
1     2     5
2     3     6
3     4     9
4     7     5

# get top records (ideally 3) within each group of dataframe

In [174]:
import pandas as pd
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
df

Original DataFrame

   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

In [175]:
df1=df.nlargest(3,'col1')
df1

   col1  col2  col3
5    11     0    11
4     7     5     1
3     4     9    12

In [176]:
df2=df.nlargest(3,'col2')
df2

   col1  col2  col3
3     4     9    12
2     3     6     8
1     2     5     5

In [177]:
df3= df.nlargest(3,'col3')
df3

   col1  col2  col3
3     4     9    12
5    11     0    11
2     3     6     8

In [178]:
df

   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

# remove/delete first 3 rows of dataframe

In [179]:
df = df.iloc[3:]

In [180]:
df

   col1  col2  col3
3     4     9    12
4     7     5     1
5    11     0    11

In [187]:
import pandas as pd
d = {'col1': [1, 2, 3, 4, 7, 11], 
     'col2': [4, 5, 6, 9, 5, 0], 
     'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
df = df.iloc[:4]

In [188]:
df

   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12